Repository: MahrukZ/Chartist-Walking-Trials
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: cy

source: Page Not Found
cy: Tudalen Heb Darganfod

source: Hmm, something went wrong.
cy: Hmm, aeth rhywbeth o'i le.

source: Unfortunately, this page doesn't exist.
cy: Yn anffodus, nid yw'r dudalen hon yn bodoli.

source: Please try heading back to the %(link)s or use the menu (at the top of the page) to find what you're looking for.
cy: Ceisiwch fynd yn ôl i'r %(link)s neu defnyddiwch y ddewislen (ar frig y dudalen) i ddod o hyd i'r hyn rydych chi'n edrych amdano.

source: Did you arrive here from a link you clicked on our website? Please %(link)s so that we can fix it!
cy: A wnaethoch chi gyrraedd yma o ddolen y gwnaethoch chi glicio ar ein gwefan? %(link)s os gwelwch yn dda, fel y gallwn ei drwsio!

source: <a href="/contact">let us know</a>
cy: <a href="/contact">Gadewch i ni wybod</a>

source: About Chartists
cy: Ynglŷn â Siartwyr

source: To the men and women of Newport
cy: I ddynion a menywod Casnewydd

source: Did you know that around 22 men were shot dead on a Newport street in 1839? They were Chartists. They were demonstrating for freedoms we take for granted today.
cy: Oeddech chi'n gwybod bod tua 22 o ddynion wedi'u saethu ac wedi marw ar stryd yng Nghasnewydd ym 1839? Maent yn Siartwyr. Roeddent yn arddangos dros rhyddid a gymerwn yn ganiataol heddiw.

source: The Newport story starts in 1839 when thousands of working men gathered in the South Wales Valleys and marched on Newport through a cold and wet November night. The exact motives for the march are debatable. Some, including John Frost, were protesting about the injustices and asking for the release of fellow Chartists. Others were intent on creating an uprising.
cy: Mae stori Casnewydd yn cychwyn ym 1839 pan ymgasglodd miloedd o dynion sy'n gweithio yng Nghymoedd De Cymru a gorymdeithio ar Gasnewydd trwy annwyd a gwlyb Noson Tachwedd. Yr union gymhellion ar gyfer yr orymdaith yn ddadleuol. Roedd rhai, gan gynnwys John Frost, yn protestio am yr anghyfiawnderau a gofyn am y rhyddhau cyd-Siartwyr. Roedd eraill yn benderfynol creu gwrthryfel.

source: Chartism a national movement trying to improve the living and working conditions for all through Parliamentary Reform.
cy: Mudiad cenedlaethol oedd Siartiaeth yn ceisio gwella'r amodau byw a gweithio i bawb drwyddo Diwygio Seneddol.

source: “The People’s Charter” consisted of six demands:
cy: Roedd "Siarter y Bobl" yn cynnwys o chwe galw:

source: Secret ballot
cy: Pleidlais gyfrinachol

source: Votes for all men over 21
cy: Pleidleisiau i bob dyn dros 21 oed

source: Payment for MPs
cy: Taliad i ASau

source: Equal size constituencies
cy: Etholaethau maint cyfartal

source: No property qualification for MPs
cy: Dim cymhwyster eiddo ar gyfer ASau

source: Annual Parliamentary elections
cy: Etholiadau Seneddol blynyddol

source: Further information can be found on:
cy: Mae mwy o wybodaeth ar:

source: Link
cy: Dolen

source: The Chartist Petition (1843)
cy: Deiseb y Siartwyr (1843)

source: Chartists Song
cy: Cân y Siartwyr

source: Contact Us
cy: Cysylltwch â Ni

source: If you have any Further questions about the walk, please fill in the form below!
cy: Os oes gennych unrhyw gwestiynau pellach am y daith gerdded, llenwch y ffurflen isod!

source: Feedback
cy: Adborth

source: We'd love to hear your feedback! Let us know about your experience of using our new website.
cy: Byddem wrth ein bodd yn clywed eich adborth! Gadewch inni wybod am eich profiad o ddefnyddio ein gwefan newydd.

source: Name
cy: Enw

source: what star rating would you give the website? (with 5 being excellent)
cy: pa sgôr seren fyddech chi'n ei rhoi i'r wefan? (gyda 5 yn rhagorol)

source: One
cy: Un

source: Two
cy: Dau

source: Three
cy: Tri

source: Four
cy: Pedwar

source: Five
cy: Pump

source: How easy was it to follow the map and go to the differnt location? (with 5 being very easy)
cy: Pa mor hawdd oedd dilyn y map a mynd i'r lleoliad gwahanol? (gyda 5 yn hawdd iawn)

source: Out of 5 would you do the walk again? (with 5 being very likely)
cy: Allan o 5 fyddech chi'n gwneud y daith gerdded eto? (gyda 5 yn debygol iawn)

source: enter feedback Message (optional)
cy: nodwch neges adborth (dewisol)

source: Submit feedback
cy: Anfon adborth

source: Chartists Walking Trail
cy: Llwybr Cerdded y Siartwyr

source: Home
cy: Hafan

source: About
cy: Amdanom

source: Quiz
cy: Cwis

source: Contact
cy: Cysylltu

source: Dashboard
cy: Dangosfwrdd

source: Chartism was a national movement trying to improve the living and working conditions for all through Parliamentary Reform.
cy: Roedd Siartiaeth yn fudiad cenedlaethol a geisiodd wella amodau byw a gweithio i bawb trwy Ddiwygio Seneddol.

source: Read more
cy: Darllen mwy

source: Copyright %(year)s Chartist Walking Trail.
cy: Hawlfraint %(year)s Llwybr Cerdded y Siartwyr.

source: Quiz Questions
cy: Cwestiynau Cwis

source: Question 1.
cy: Cwestiwn 1.

source: Who are Chartists?
cy: Pwy yw Siartwyr?

source: 32 men were shot dead on a queen street
cy: Saethwyd 32 o ddynion ar stryd frenhines

source: 32 men were shot dead on a newport street
cy: Saethwyd 32 o ddynion ar stryd Casnewydd

source: 32 men were shot dead on a canada street
cy: Saethwyd 32 o ddynion ar stryd canada

source: Question 2
cy: Cwestiwn 2.

source: In which year, Chartists were dead?
cy: Ym mha flwyddyn, roedd Siartwyr wedi marw?

source: Question 3.
cy: Cwestiwn 3.

source: For what purpose were they demonstrating for?
cy: At ba bwrpas yr oeddent yn arddangos?

source: rights
cy: hawliau

source: change of government
cy: newid llywodraeth

source: freedom
cy: rhyddid

source: Question 4.
cy: Cwestiwn 4.

source: Define Chartism?
cy: Diffinio Siartiaeth?

source: Chartism a national movement trying to improve the living and working conditions for all through Parliamentary Reform
cy: Roedd Chartism yn fudiad cenedlaethol a geisiodd wella amodau byw a gweithio i bawb trwy Ddiwygio Seneddol

source: Chartism an international trying to improve the living conditions for all through Parliamentary Reform
cy: Roedd Siartiaeth yn rhyngwladol a geisiodd wella'r amodau byw i bawb trwy Ddiwygio Seneddol

source: Chartism a national movement trying to improve the health conditions for all through Parliamentary Reform
cy: Mudiad cenedlaethol oedd Siartiaeth yn ceisio gwella'r cyflyrau iechyd i bawb trwy Ddiwygio Seneddol

source: Question 5.
cy: Cwestiwn 5.

source: How many demands did “people’s Charter” consisted of?
cy: Faint o alwadau oedd “Siarter y pobl” yn eu cynnwys?

source: Question 6.
cy: Cwestiwn 6.

source: Which one can be a chartist demand?
cy: Pa un all fod yn alw siarter?

source: open ballot
cy: pleidlais agored

source: Votes for all men over 18
cy: Pleidleisiau i bob dyn dros 18 oed

source: Question 7.
cy: Cwestiwn 7.

source: Where did working men (chartists) gathered?
cy: Ble casglodd dynion gwaith (siartwyr)?

source: Cardiff
cy: Caerdydd

source: south wales
cy: de cymru

source: Swansea
cy: Abertawe

source: Question 8.
cy: Cwestiwn 8.

source: Which street were Chartists shot on?
cy: Ar ba stryd y saethwyd Siartwyr?

source: Bristol street
cy: Stryd Bryste

source: Canada street
cy: Stryd Canada

source: Newport street
cy: Stryd Casnewydd

source: Grade Me
cy: Graddio Fi

source: Clear
cy: Ail gychwyn
